1. What is your funding plan for the future >sdf
Along with the development of Seele mainnet in the past two years, we had seen the both sides of Seele's ICO. The good thing was at least the foundation paid the development team a small potion of the fund they received from the ICO. From our past experience, we like our future project to be supported by its community on a voluntary base. So that our team only obligate to the community and ourselves. We hope that our team can make a major contribution in the future to the crypto and blockchain.
2. Do you have good contacts to Huobi? As in case of there coming into existence TWO coins the large exchange wields huge power. #amadev
No, we do not.
3. Hello team, my seele's token was stored in my ledger, after few months of absence from my part, today I can't find my tokens anymore ! Have I missed something ?  #amadev
We are sure that your token secure if you still have your password.
重复1：Do you have funds or potential investors to continue operation like you did in the last two years? #amadev
4. SeeleN wrote that they have the majority of shares and suspend the SeeleTech operation. Does Seele have the legal rights to continue as Seele? #amadev
They cannot stop SeeleTech operation if there is fund to pay its employees.The real situation: SeeleTech has a liability and no hard assets except for a few office desks and laptops. Of course the major shareholders do not want to be reponssible for the libility. Beside our team hold 25% shares and it is in US.
5. Did the original seele team have reservations on mainnet tokens? Are the people behind seele foundation the same people listed on seelen.pro? #amadev
The seele development team have no reservations on the mainnet tokens. We leave the second question to the community to figure it out.
6. #devama# what is the plan and strategy for token swap?
The seele development team own zero ERC 20 token. We do not have the answer.
7. #amadev How did Roc Wong join Seele, and what has the relationship been like?
Roc Wong didn't join SeeleTech. He is a contact person between SeeleTech and PolyChain Capital,which invested in SeeleTech.
8. #devama# can dev team give an introduction to what has happened, what is the status(control of TG, tweeter, etc), what is dev team's next plan, token swap plan, what hapened to granulation?
We will talk our next plan before not that long. The development team need a break and think all possible options.
To swap and granulation, our team have no answer.
9. #amadev Why was the token swap delayed for so long?
The development team fulfilled our obligation -- delivered the main net (which has been running for over a year) and released subnet beta version. We do not own any ERC 20, and do not know who charges for the swap.
10. #amadev  What achievements in Seele are you most proud of?
We are gratiful to our Seele community. The main net has been running over a year and nobody can stop it even major share holders tried to stop SeeleTech. We are also very proud of our hard work, our MPoW consensus algorithm, the Seele sharding technolgy, the Seele subnet, etc.
11. #amadev Ideally what do you see as the future of the project
The Seele main net will be running with the support from the community. We believe no one can stop the main net.
12. #amadev Is there any hope to come to an agreement with the foundation
The relationship between the development team and the foundation ceased long time ago. Our financial support in the past year is from PolyChain Capital. The annoucemnents from Polychain Capital and the Seele foundation in website Seelen.pro stated the situation very clearly and loud. But any thing is possible as long as it is good to the community and Seele mainnet.
13. #amadev How do you view erc 20 tokens and how do you view mainnet tokens
Without the swap -- erc20 tokens are erc20 tokens,  mainnet tokens are mainnet tokens.They live in different worlds.
14. #amadev What's your vision for the future of Seele
The mainnet has been running over a year, it will live for a long time with minners and community's support.
15. #amadev When would you envisage industry starting to use Seele
The seele subnet techonlogy is still in its earlier stage, its beta version was released on March 31st,2020. With this technology and the mainnet, industry starts to use Seele technology only a matter of time, that is our hope.
16. #amadev   who is responsible for communicating with Huobi about the list and swap? Foundation or del team?
The development team are only responsible for the development of the seele mainnet and subnet.
重复1 #amadev  How will you continue the project in current status? do you have any other big investor?
Currently we do not have any investors. The support to the Seele main net will be voluntary from us after May 31st,2020.
17. #amadev - if the dev team could continue with development, how would that be funded? And if funding was available, would the dev team employ some "business" people (non techies) to handle the business development side?
The members of ours team are all engineers. If fund was available in the future, that would be a good idea to have some business people on board.
18. #amadev How did we get to the position where the dev team and Dr Maolin didn't have a majority ownership of shares in the project, if this is ture?
We guess what you mean is the majority ownership of SeeleTech. The team and Dr Zheng own 25% of SeeleTech. Our team own the interlectural propterty of the Seele main net.
19. #amadev Who controls the ICO funds?
We do not know -- our best guess is the guys behind the seele foundation.
20. #amadev I know you didn't agree with the granularity proposal. What advantage would this has given apart from the foundation gaining more tokens?
We do not know the proposal. Nobody talked to us about it.
Seele mainnet token has eight digits after the period "."  We think the mainnet tokens have enough granularity.
We couldn't see any added value of the granularity.
21. #amadev Why was it proposed with the erc20 tokens?
A very good question -- shall ask the question to those people who proposed it. Our best guess is the foundation own a lot ERC20 tokens (including the 7% of 70M tokens which should belong to the development team according to the ICO plan).
22. #amadev Is the seele mainnet under ownership of seele team?
We built the seele main net.We maintain it. No boday can claim the ownship. Do we own the seele mainet completely? -we leave the question to the community.
23. #amadev The team token address I have posted many times with $4.5m of tokens. Who now owns this wallet?
For the mainnet tokens, we do not know, some earlier miners?
24. #amadev Is this Dr Bi/original team?
Dr Bi was never a member of our team.
25. #amadev Who is controlling the ERC20 address 0x1ea379c97b9a6da993dd7d73669a0dafd188cffd   ?
Since we do not own any ERC 20, we do not know.
重复12 #amadev is there any chance to work cooperation with foundation again ?if so what is the Del team requirement ?
26. Are you considering forking the blockchain to introduce either a premine or a devfee system being taken on every block to fund the project. #amadev
Not! We love Seele main net! It is our team which brought it to life from near death.
27. #amadev  According to ICO token plan, Del team should get 7% of the total token(70M token or native token),did you get it?
Already mentioned we do not own any erc20 tokens. The team shall have a portion of that according to the ICO plan, 7%, but I never see it happened.
重复8. #amadev  finallly if foundation controls Seele, what is your new plan?will you start another project?
What do you mean Seele here? If that means Seele mainnet, we do not think the foundation can control it. We will take a break for a short period after working hard so long. Then we'll think of our new plan. We love what we are doing for sure.
重复6. #amadev when mainnet/erc20 token swap? When exchange listing mainnet token?
重复6 #amadev Has the technical team considered bifurcating? I'm worried that the seele token won't map for a long time.What can we do?
Not sure who are handling the map. The community have to fugure it out what to do with the mainnet tokens.We will be here and ready to support the community
28. #amadev how can leben project put into seele project? How can protect investors who invest seele? Leben, so called seele-N now, is a shit.
Ask the foundation and the community.  We do not know Leben. It is a shit or not we have no comments. We understood the frustration of the investors. We are very sad too.
重复6 How will a swap be technically performed?  Can you do it in a decentralized manner? #amadev
The swap is not a technical question. Of course, technically speaking, decentralized is possible.
29. #amadev when is token swap ? Are the coins on gow legit ? Are you guys partnered with gow and are you aware they disappeared with many people's money.
Our team do not know who is in charge of swap. We do not know GOW and have no information on it.
30. #amadev - The current live mainnet, do you see it continuing and being developed by your team? Is it still possible that the erc20 tokens could be swapped into mainnet and who controls if that could happen?
Our team will maintain the mainnet on a voluntary base from now on until we have new resources to improve it.
31. #amadev - Is there any chance mainnet tokens could be swapped to a new SeeleN network?
We do not know how that could be.
32. #amadev - How many mainnet tokens does the dev team have, could they be used to raise money for further development?
The dev team have never reserve of the mainnet tokens. We are still in earlier stage to think our options for surviving.
33. #amadev - How can the community support the dev team?
There shall be a way. For the time being, the development team think all possible options.
34. #amadev - Is the any kind of legal agreement with Huobi that states the erc20 have to be swapped with mainnet at some point?
We do not have an answer. We are in the same situation as you.
35. #amadev - Do you think SeeleN will take the source code and start their own blockchain to compete with Seele?
Seele is opensourced. Anyone can download the codes. We do not know SeeleN and have no ideas what they would do.
36. #amadev - Is there any chance of a reconciliation between dev team and foundation? Would you even consider such an option?
We open to any suggestions.
37. #amadev - could you run a small ICO to raise funds for mainnet?
Any thing possible. For the time being, the team is looking for all possible options.
